{
    "projects": [
      {
        "id": ".01",
        "name": "P1TCH",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/p1tch.png?raw=true",
        "video": "",
        "desc": "The P1TCH platform is a full-stack web application built with Laravel 11 (PHP 8.3) on the backend and React on the frontend, designed to connect event organizers with vendors for streamlined event management. The backend API features RESTful architecture, Stripe integration for payments and subscriptions, AWS S3 for storage, role-based authorization with Laravel policies, and robust testing using PHPUnit. It is containerized with Docker and Laravel Sail, and deployed via Ansible. The React frontend includes event and vendor management tools, responsive layouts, Redux for state management, and third-party integrations like Google Maps. The project handles complex user flows, secure data validation, and real-time notifications, showcasing a strong command of scalable architecture, modern DevOps, and seamless frontend-backend integration.",
        "github":"",
        "liveLink": "https://p1tch.co.uk/organiser-login",
        "tag1": "Sail",
        "tag2": "React.js",
        "tag3": "Stripe",
        "team": "Client Project"
      },
      {
        "id": ".02",
        "name": "School Consultancy Programme",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/scp.png?raw=true",
        "desc": "The School Consultancy Programme is a full-stack application built with Laravel 11 and React, designed to enhance student progress tracking and reporting in educational settings. The backend delivers a robust RESTful API for managing pupils, assessments, and tutor groups, featuring automated baseline assessments, custom console commands, and scalable architecture leveraging Laravel's job queues, event broadcasting, and PHP 8.2 features. It includes comprehensive unit and feature testing, automated deployment via Ansible, and strict adherence to Laravel's security best practices. On the frontend, the React-based interface enables educators to manage student data, visualize progress with Chart.js, and generate PDF reports using @react-pdf/renderer. With real-time updates, dynamic filters, and a responsive design, this project showcases my ability to build scalable, user-centric educational tools with seamless API integration, clean UI/UX, and reliable performance across the stack.",
        "github":"",
        "liveLink": "https://trackingportal.schoolconsultancyprogramme.co.uk/login",
        "tag1": "Laravel",
        "tag2": "React.js",
        "tag3": "Data Mapping",
        "team": "Client Project"
      },
      {
        "id": ".03",
        "name": "Unicycle.com",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/unicycle.png?raw=true",
        "video": "",
        "desc": "The Unicycle Theme is a custom WordPress and WooCommerce theme developed for unicycle.co.uk, tailored to deliver a unique and performance-optimized e-commerce experience. It includes custom WooCommerce templates for cart, checkout, and product pages, as well as bespoke tools like spoke and frame calculators integrated directly into the theme. It features dynamic product tabs with linked blog content, Swiper.js-powered carousels and Headroom.js for dynamic headers. Styled with LESS, the theme emphasises fast load times and Core Web Vitals compliance, showcasing expertise in custom WordPress development, WooCommerce integration, and delivering tailored e-commerce functionality with a focus on performance and international reach.",
        "github":"",
        "liveLink": "https://www.unicycle.co.uk/",
        "tag1": "PHP",
        "tag2": "E-Commerce",
        "tag3": "Custom WordPress theme development",
        "team": "Client Project"
      },
      {
        "id": ".04",
        "name": "Anchord",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/anchord.png?raw=true",
        "video": "",
        "desc": "Anchord frontend is a responsive, modern Next.js e-commerce application designed to enable users to purchase and subscribe to raffles. The application also enables users to manage accounts, browse products, and complete purchases. It features a dynamic product catalog supporting one-time purchases and subscriptions, alongside a persistent cart system powered by Redux Toolkit and local storage. The checkout flow integrates with Stripe for secure payments, including express options, and provides detailed order summaries. Built with React, styled using LESS, and containerized with Docker, the application ensures a seamless user experience across devices. Additional features include maintenance mode middleware, dynamic routing, and stateful session management. This project highlights expertise in Next.js, Stripe integration, state management, and building scalable, production-ready web applications.",
        "github":"",
        "liveLink": "https://anchord.co.uk/",
        "tag1": "Next.js",
        "tag2": "Microservices",
        "tag3": "E-Commerce",
        "team": "Client Project"
      },
      {
        "id": ".05",
        "name": "Cranfield Aerospace",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/cranfield.png?raw=true",
        "video": "",
        "desc": "Developed using WordPress and Elementor; one of the leading drag-and-drop page builder themes. Cranfield Aerospace Solutions is a dynamic website that effectively presents the company's pioneering efforts in developing zero-emission hydrogen-powered aircraft. Through strategic use of customisable templates and responsive design features, the site offers an intuitive user experience, showcasing CAeS's commitment to sustainability and innovation in the aviation industry.",
        "github":"",
        "liveLink": "https://cranfieldaerospace.com/",
        "tag1": "Wordpress",
        "tag2": "Elementor",
        "tag3": "Theme Build",
        "team": "Client Project"
      },
      {
        "id": ".06",
        "name": "Nara Living",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/nara.png?raw=true",
        "video": "",
        "desc": "The Nara Living project is a custom WordPress theme built for naraliving.co.uk, tailored specifically for showcasing property developments. It features a modern, responsive design with custom templates powered by Advanced Custom Fields (ACF), including flexible content sections for bedrooms, amenities, and hero areas. On the frontend, it integrates Swiper.js for carousels, with all pages styled with custom LESS compiled to CSS. The backend includes ACF-driven content management, custom WordPress hooks, Google Maps API integration and a bespoke theme setup for easy updates. The project highlights expertise in custom WordPress development, ACF integration, and delivering tailored solutions, ensuring a seamless user experience and efficient content management.",
        "github":"",
        "liveLink": "https://naraliving.co.uk/",
        "tag1": "Custom WordPress theme development",
        "tag2": "Advanced Custom Fields",
        "tag3": "Javascript",
        "team": "Client Project"
      },
      {
        "id": ".07",
        "name": "Engine AI",
        "img": "https://github.com/aslivingston/portfolio/blob/gnar-update/css/projectAssets/engine.png?raw=true",
        "video": "",
        "desc": "Developed using Webflow, Leading AI is a dynamic website that effectively presents a range of AI-powered tools aimed at improving knowledge accessibility and decision-making processes. Through strategic use of Webflow's CMS and responsive design capabilities, the site offers an intuitive user experience, showcasing the practical applications of AI in various sectors.",
        "github":"",
        "liveLink": "https://www.leadingai.co.uk/",
        "tag1": "Webflow",
        "tag2": "Page Builder",
        "tag3": "CMS",
        "team": "Client Project"
      },
      {
        "id": ".08",
        "name": "Job Search Website",
        "img": "https://github.com/aslivingston/portfolio/blob/main/css/projectAssets/job-search-preview.png?raw=true",
        "video": "",
        "desc": "Using a pre-built API, I worked in a scrum team to build a job search website. The site utilised Tailwind, React, and Javascript. I developed distinct components to showcase recent jobs, related jobs, and individual job details. The website also features a search bar function enabling users to filter by job title or company name to interact with the back-end API.",
        "github":"https://github.com/iO-Academy/24-jan-frolicking-frogs-jobsearch",
        "liveLink": "https://24-frolickingfrogs-jobsearch.dev.io-academy.uk/",
        "tag1": "JavaScript",
        "tag2": "React.js",
        "tag3": "API Interaction",
        "team": "Academic Project"
      },
      {
        "id": ".09",
        "name": "Blog Post Website",
        "img": "https://github.com/aslivingston/portfolio/blob/main/css/projectAssets/blog-website-preview.png?raw=true",
        "video": "",
        "desc": "Using provided front-end code, I worked in a scrum team to develop a blog post website with PHP. The site was built following OOP design patterns and various handlers to streamline and organise the code. The website employs MySQL queries for selecting, filtering, joining, and ordering to display blog posts. Additionally, the site implements a login and registration system built from scratch, incorporating password verification to interact with the database, along with a likes and dislikes functionality. The site has also been checked with Unit Tests for the relevant methods.",
        "github":"https://github.com/iO-Academy/24-jan-frolicking-frogs-blogging-site",
        "liveLink": "https://24-frolickingfrogs-blog.dev.io-academy.uk/",
        "tag1": "PHP + PHPUnit",
        "tag2": "MySQL",
        "tag3": "OOP Design Patterns",
        "team": "Academic Project"
      },
      {
        "id": ".10",
        "name": "Hotel Booking API",
        "img": "https://github.com/aslivingston/portfolio/blob/main/css/hotel-booking-api.png?raw=true",
        "video": "",
        "desc": "The Hotel Booking System is a web application built with Laravel, a PHP framework, to manage bookings for a hotel. Using a pro-built front-end the system allows managers to make reservations for rooms and provides administrative features for hotel staff to manage bookings and room availability. Staff members can search for available rooms, view room details, and make reservations for specific dates. The system tracks room availability based on booked dates and prevents double bookings. Hotel staff have access to an different pages where they can manage bookings and view reports on room popularity. The system generates reports on room occupancy, average booking duration, and other relevant metrics to assist hotel management in decision-making.",
        "github":"https://github.com/iO-Academy/24-jan-frolicking-frogs-hotel-api",
        "liveLink": "https://24-frolickingfrogs-hotel-fe.dev.io-academy.uk/",
        "tag1": "Laravel",
        "tag2": "RESTful API",
        "tag3": "PHPUnit",
        "team": "Academic Project"
      },
      {
        "id": ".11",
        "name": "Card Collector App",
        "img": "https://github.com/aslivingston/portfolio/blob/main/css/projectAssets/card-collector-preview.png?raw=true",
        "video": "",
        "desc": "The card collector app is a personal project to practice PHP concepts and skills. The app is intended to keep a wallet of digital sports cards to show off to friends and family. The site is built using PHP and mySQL to display cards from the database. The cards collection can also be filtered by sport. Within the collection a user can add cards to the site, edit details of existing cards, and remove cards from the collection.",
        "github":"https://github.com/aslivingston/all-star-cards",
        "liveLink": "https://all-star-cards.2024-alexl.dev.io-academy.uk/index.php",
        "tag1": "PHP",
        "tag2": "MySQL",
        "tag3": "OOP Design Patterns",
        "team": "Personal Project"
      },
      {
        "id": ".12",
        "name": "Recruitment Website",
        "img": "https://github.com/aslivingston/portfolio/blob/main/css/projectAssets/Screenshot%202024-03-15%20at%2013.24.43.png?raw=true",
        "video": "",
        "desc": "Personal re-build of a squarespace wesbite for a recruitment company. The project uses a component structure via React across the site to help code organisation and refresh speed when navigating around the site. The site combines JSX with HTML and CSS.",
        "github":"https://github.com/aslivingston/picked-careers",
        "liveLink": "https://picked-careers.2024-alexl.dev.io-academy.uk/",
        "tag1": "React.js",
        "tag2": "JavaScript",
        "tag3": "HTML / CSS",
        "team": "Personal Project"
      },
      {
        "id": ".13",
        "name": "Weather Forecast App",
        "img": "https://github.com/aslivingston/portfolio/blob/main/css/weather-app.png?raw=true",
        "video": "",
        "desc": "Personal build for a Weather Forecast Application tool developed using React.js. It provides users with accurate weather forecasts for their desired locations. Users can enter a city or town name, and the application fetches real-time weather data, including temperature and weather conditions for the next five days. The application retrieves real-time weather data from an external API, ensuring accuracy and reliability. It performs location validation to ensure that users enter valid locations. If an invalid location is entered, appropriate error messages are displayed. The background color of the application dynamically changes based on the current weather conditions, providing visual cues to users.",
        "github": "https://github.com/aslivingston/weather-app",
        "liveLink": "https://weather-app.2024-alexl.dev.io-academy.uk/",
        "tag1": "React.js",
        "tag2": "JavaScript ES6+",
        "tag3": "Geocoding + RESTful APIs",
        "team": "Personal Project"
      }
    ]
  }